# ci/cd

지속적 통합 (Continuous Integration) 및 지속적 제공/배포 (Continuous Delivery/Deployment)를 의미

- CI : 코드 변경 사항을 공유 소스 코드 레포지토리에 자동으로 자주 통합하는 사례 (자동 프로덕션 배포 기능 없음)
- CD : 코드 변경 사항의 통합, 테스트, 제공을 나타내는 프로세스 (업데이트를 프로덕션 환경에 자동으로 릴리스)

연결된 두 사례를 일반적으로 `CI/CD 파이프라인`이라고 부름

새 코드를 커밋에서 프로덕션으로 가져오는 데 필요했던 수동 개입을 CI/CD가 자동화하므로 다운타임이 최소화, 코드 릴리즈 주기가 단축

코드 업데이트와 변경 사항을 더 빠르게 통합할 수 있음

- 파이프라인 : 코드를 빌드/테스트/배포하는 과정을 거쳐 소프트웨어 개발을 추진하는 프로세스. 프로세스를 자동화함으로써 인적 오류를 최소화하고 소프트웨어 출시 방식에 일관된 프로세스를 유지하는 것이 목표
    - 코드 컴파일, 유닛 테스트, 코드 분석, 보안, 바이너리 생성
    - 컨테이너화 된 환경에서 하이브리드 클라우드 전반에 배포할 컨테이너 이미지에 코드를 패키징하는 경우도 포함
